diploma thesis/src/design/assets/deploy-request.xml

<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:core="http://core.bootware.simtech.org/">
	<soapenv:Header/>
	<soapenv:Body>
		<core:deploy>
			<arg0>
				<connectionType>c2-1.0.0.jar</connectionType>
				<infrastructureType>i1-1.0.0.jar</infrastructureType>
				<payloadType>p1-1.0.0.jar</payloadType>
			</arg0>
		</core:deploy>
	</soapenv:Body>
</soapenv:Envelope>
